In [1]:
import pandas as pd
import numpy as np
import json

In [2]:
# reading in the movies metadata
df = pd.read_csv('movies_metadata.csv')
df.head().transpose()

/home/lord_black/anaconda3/envs/movieCap1/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,0,1,2,3,4
adult,False,False,False,False,False
belongs_to_collection,"{'id': 10194, 'name': 'Toy Story Collection', ...",NaN,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",NaN,"{'id': 96871, 'name': 'Father of the Bride Col..."
budget,30000000,65000000,0,16000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...","[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...","[{'id': 35, 'name': 'Comedy'}]"
homepage,http://toystory.disney.com/toy-story,NaN,NaN,NaN,NaN
id,862,8844,15602,31357,11862
imdb_id,tt0114709,tt0113497,tt0113228,tt0114885,tt0113041
original_language,en,en,en,en,en
original_title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II
overview,"Led by Woody, Andy's toys live happily in his ...",When siblings Judy and Peter discover an encha...,A family wedding reignites the ancient feud be...,"Cheated on, mistreated and stepped on, the wom...",Just when George Banks has recovered from his ...
popularity,21.9469,17.0155,11.7129,3.85949,8.38752
poster_path,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg,/e64sOI48hQXyru7naBFyssKFxVd.jpg
production_companies,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'name': 'Warner Bros.', 'id': 6194}, {'name'...",[{'name': 'Twentieth Century Fox Film Corporat...,"[{'name': 'Sandollar Productions', 'id': 5842}..."
production_countries,"[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o..."
release_date,1995-10-30,1995-12-15,1995-12-22,1995-12-22,1995-02-10
revenue,3.73554e+08,2.62797e+08,0,8.14522e+07,7.65789e+07
runtime,81,104,101,127,106
spoken_languages,"[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}, {'iso...","[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}]"
status,Released,Released,Released,Released,Released
tagline,NaN,Roll the dice and unleash the excitement!,Still Yelling. Still Fighting. Still Ready for...,Friends are the people who let you be yourself...,Just When His World Is Back To Normal... He's ...
title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II
video,False,False,False,False,False
vote_average,7.7,6.9,6.5,6.1,5.7
vote_count,5415,2413,92,34,173

I get an warning because column 10 has mixed data types.

In [3]:
# look at data types in column 10
df['popularity'].apply(type).value_counts()

<class 'float'>    32769
<class 'str'>      12697
Name: popularity, dtype: int64

Some of the numeric data are strings.

In [4]:
# convert strings to numeric and check that it worked
df['popularity'] = pd.to_numeric(df['popularity'], errors='coerce')
df['popularity'].apply(type).value_counts()

<class 'float'>    45466
Name: popularity, dtype: int64

In [5]:
# check number of entries and columns
df.shape

(45466, 24)

We are starting with 45,466 entries.

In [6]:
# store number of original entries
STARTING_ROWS = df.shape[0]
STARTING_ROWS

45466

I will start by removing columns that I do not need.

In [7]:
# create a list of features to remove
drop_list = ['adult', 'homepage', 'original_language', 'original_title', 'overview', 'popularity', 'poster_path', 
             'production_companies', 'production_countries', 'spoken_languages', 'status', 'tagline', 'video', 
             'vote_average', 'vote_count']

In [8]:
# remove the columns not needed
df = df.drop(drop_list, axis=1)
df.head().transpose()

,0,1,2,3,4
belongs_to_collection,"{'id': 10194, 'name': 'Toy Story Collection', ...",NaN,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",NaN,"{'id': 96871, 'name': 'Father of the Bride Col..."
budget,30000000,65000000,0,16000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...","[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...","[{'id': 35, 'name': 'Comedy'}]"
id,862,8844,15602,31357,11862
imdb_id,tt0114709,tt0113497,tt0113228,tt0114885,tt0113041
release_date,1995-10-30,1995-12-15,1995-12-22,1995-12-22,1995-02-10
revenue,3.73554e+08,2.62797e+08,0,8.14522e+07,7.65789e+07
runtime,81,104,101,127,106
title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II

In [9]:
# check number of columns after dropping some
df.shape

(45466, 9)

In [10]:
# look at what's left
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  4494 non-null   object
 1   budget                 45466 non-null  object
 2   genres                 45466 non-null  object
 3   id                     45466 non-null  object
 4   imdb_id                45449 non-null  object
 5   release_date           45379 non-null  object
 6   revenue                45460 non-null  float64
 7   runtime                45203 non-null  float64
 8   title                  45460 non-null  object
dtypes: float64(2), object(7)
memory usage: 3.1+ MB

> **BELONGS TO COLLECTION**

I want the collection data to be simple boolean values.

In [11]:
# look at the data types for column
df['belongs_to_collection'].apply(type).value_counts()

<class 'float'>    40972
<class 'str'>       4494
Name: belongs_to_collection, dtype: int64

In [12]:
# convert all the NaN's to False
df['belongs_to_collection'] = df['belongs_to_collection'].fillna(False)
df['belongs_to_collection'].apply(type).value_counts()

<class 'bool'>    40972
<class 'str'>      4494
Name: belongs_to_collection, dtype: int64

In [13]:
# convert all the strings to True
df['belongs_to_collection'] = df['belongs_to_collection'].astype(bool)
df['belongs_to_collection'].apply(type).value_counts()

<class 'bool'>    45466
Name: belongs_to_collection, dtype: int64

In [14]:
# inspect to see that it worked
df.head().transpose()

,0,1,2,3,4
belongs_to_collection,True,False,True,False,True
budget,30000000,65000000,0,16000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...","[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...","[{'id': 35, 'name': 'Comedy'}]"
id,862,8844,15602,31357,11862
imdb_id,tt0114709,tt0113497,tt0113228,tt0114885,tt0113041
release_date,1995-10-30,1995-12-15,1995-12-22,1995-12-22,1995-02-10
revenue,3.73554e+08,2.62797e+08,0,8.14522e+07,7.65789e+07
runtime,81,104,101,127,106
title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II

> **BUDGET**

Before attempting to convert budget values to numeric values, I will inspect a few messy rows.

In [15]:
# make list of indices of messy data
messy_budget = [19730, 29503, 35587]

In [16]:
# inspect messy rows
df.iloc[messy_budget]

,belongs_to_collection,budget,genres,id,imdb_id,release_date,revenue,runtime,title
19730,True,/ff9qCepilowshEtG2GYWwzt2bs4.jpg,"[{'name': 'Carousel Productions', 'id': 11176}...",1997-08-20,0,1,NaN,NaN,NaN
29503,True,/zV8bHuSL6WXoD6FWogP9j4x80bL.jpg,"[{'name': 'Aniplex', 'id': 2883}, {'name': 'Go...",2012-09-29,0,12,NaN,NaN,NaN
35587,True,/zaSf5OG7V8X8gqFvly88zDdRm46.jpg,"[{'name': 'Odyssey Media', 'id': 17161}, {'nam...",2014-01-01,0,22,NaN,NaN,NaN

I can drop these rows completely, since the data is incomprehensible.

In [17]:
before_dropped = 0
def rows_dropped():
    """Returns the number of rows dropped since last call"""
    global before_dropped
    just_dropped = STARTING_ROWS - before_dropped - df.shape[0]
    # adjusts number of row dropped since last call
    before_dropped += just_dropped
    return f'{just_dropped} row(s) just dropped.'

In [18]:
# dropping the messy rows
df = df.drop(df.index[messy_budget])
rows_dropped()

'3 row(s) just dropped.'

Now, I'll inspect the budget data.

In [19]:
# look at the data types in budget
df['budget'].apply(type).value_counts()

<class 'str'>    45463
Name: budget, dtype: int64

In [20]:
# converting budget values from strings to numeric
df['budget'] = pd.to_numeric(df['budget'])
df['budget'].apply(type).value_counts()

<class 'int'>    45463
Name: budget, dtype: int64

> **RELEASE DATE**

Let's look at the release date column.

In [21]:
# convert release dates to datetime objects
df['release_date'] = pd.to_datetime(df['release_date'])
df.head().transpose()

,0,1,2,3,4
belongs_to_collection,True,False,True,False,True
budget,30000000,65000000,0,16000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...","[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...","[{'id': 35, 'name': 'Comedy'}]"
id,862,8844,15602,31357,11862
imdb_id,tt0114709,tt0113497,tt0113228,tt0114885,tt0113041
release_date,1995-10-30 00:00:00,1995-12-15 00:00:00,1995-12-22 00:00:00,1995-12-22 00:00:00,1995-02-10 00:00:00
revenue,3.73554e+08,2.62797e+08,0,8.14522e+07,7.65789e+07
runtime,81,104,101,127,106
title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II

In [22]:
# check for functionality
df['release_date'][0].year

1995

Before we continue, let's find out how many missing values in the data are labeled as zero.<br>
I will convert them to NaN.

In [23]:
# finding values == 0
df.isin([0]).sum()

belongs_to_collection    40972
budget                   36573
genres                       0
id                           0
imdb_id                      0
release_date                 0
revenue                  38052
runtime                   1558
title                        0
dtype: int64

It seems that there are a lot of missing data hidden in values of 0 in the budget, revenue, and runtime columns.

In [24]:
# create list of columns with zeros to replace
zeros_cols = ['budget', 'revenue', 'runtime']

In [25]:
# convert 0 values to NaN's
df[zeros_cols] = df[zeros_cols].replace(0, np.nan)
df.isin([0]).sum()

belongs_to_collection    40972
budget                       0
genres                       0
id                           0
imdb_id                      0
release_date                 0
revenue                      0
runtime                      0
title                        0
dtype: int64

In [26]:
# checking with info method, again
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 45463 entries, 0 to 45465
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  45463 non-null  bool
 1   budget                 8890 non-null   float64
 2   genres                 45463 non-null  object
 3   id                     45463 non-null  object
 4   imdb_id                45446 non-null  object
 5   release_date           45376 non-null  datetime64[ns]
 6   revenue                7408 non-null   float64
 7   runtime                43645 non-null  float64
 8   title                  45460 non-null  object
dtypes: bool(1), datetime64[ns](1), float64(3), object(4)
memory usage: 4.4+ MB

> **REVENUE**

Now, I'll look at the revenue column, which has either float numbers or NaN's.

In [27]:
# get a count on the missing values
df.isnull().sum()

belongs_to_collection        0
budget                   36573
genres                       0
id                           0
imdb_id                     17
release_date                87
revenue                  38055
runtime                   1818
title                        3
dtype: int64

It looks like this column has the least amount of numerical values, but it appears to be clean.

> **INFLATION**

I need to convert both the budget and revenue data to be adjusted for inflation.<br>
I will read in the Consumer Price Index (CPI) data I downloaded from the Federal Reserve Economic Data (FRED).

In [28]:
# load inflacion data
inflation_df = pd.read_csv('cpiaucns.csv')
inflation_df.head()

         DATE  CPIAUCNS
0  1913-01-01       9.8
1  1913-02-01       9.8
2  1913-03-01       9.8
3  1913-04-01       9.8
4  1913-05-01       9.7

In [29]:
inflation_df.tail()

            DATE  CPIAUCNS
1282  2019-11-01   257.208
1283  2019-12-01   256.974
1284  2020-01-01   257.971
1285  2020-02-01   258.678
1286  2020-03-01   258.115

Let's make this DataFrame more pythonic by adjusting the column names.

In [30]:
# making column names lower case
inflation_df.columns = map(str.lower, inflation_df.columns)
inflation_df.columns

Index(['date', 'cpiaucns'], dtype='object')

This dataset hold monthly inflation rates from the first month of 1913 until March of 2020.

In [31]:
# checking that the data is clean
inflation_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1287 entries, 0 to 1286
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      1287 non-null   object
 1   cpiaucns  1287 non-null   float64
dtypes: float64(1), object(1)
memory usage: 20.2+ KB

I need to convert the dates to datetime objects.

In [32]:
# convert string dates to datetime objects
inflation_df['date'] = pd.to_datetime(inflation_df['date'], format='%Y/%m/%d')
inflation_df['date'].dtype

dtype('<M8[ns]')

I will create an index multiplier column to index all monetary values based on the most current date in this dataset.

In [33]:
# making new column for multiplier, and looking at the earliest dates
inflation_df['cpi_multiplier'] = inflation_df['cpiaucns'].iloc[-1] / inflation_df['cpiaucns']
inflation_df.head()

        date  cpiaucns  cpi_multiplier
0 1913-01-01       9.8       26.338265
1 1913-02-01       9.8       26.338265
2 1913-03-01       9.8       26.338265
3 1913-04-01       9.8       26.338265
4 1913-05-01       9.7       26.609794

In [34]:
# looking at the most recent dates
inflation_df.tail()

           date  cpiaucns  cpi_multiplier
1282 2019-11-01   257.208        1.003526
1283 2019-12-01   256.974        1.004440
1284 2020-01-01   257.971        1.000558
1285 2020-02-01   258.678        0.997824
1286 2020-03-01   258.115        1.000000

This looks correct.<br>
Now I need to merge this into the main DataFrame.<br>
First, I need to sort the main DataFrame by date.

In [35]:
# sort by release date
df.sort_values('release_date', inplace=True)
df

,belongs_to_collection,budget,genres,id,imdb_id,release_date,revenue,runtime,title
34940,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",315946,tt3155794,1874-12-09,NaN,1.0,Passage of Venus
34937,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",194079,tt2221420,1878-06-14,NaN,1.0,Sallie Gardner at a Gallop
41602,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",426903,tt5459794,1883-11-19,NaN,1.0,Buffalo Running
34933,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",159897,tt2075247,1887-08-18,NaN,1.0,Man Walking Around a Corner
34934,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",96882,tt1758563,1888-01-01,NaN,1.0,Accordion Player
...,...,...,...,...,...,...,...,...,...
45148,False,NaN,[],438910,tt0810384,NaT,NaN,76.0,Engineering Red
45203,False,NaN,"[{'id': 9648, 'name': 'Mystery'}, {'id': 878, ...",433711,tt3158690,NaT,NaN,74.0,All Superheroes Must Die 2: The Last Superhero
45338,False,NaN,[],335251,tt1883368,NaT,NaN,NaN,The Land Where the Blues Began
45410,False,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name...",449131,tt0321264,NaT,NaN,NaN,Aprel
45461,False,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",439050,tt6209470,NaT,NaN,90.0,Subdue

I can see that NaT's are at the end.

I will drop all movies that were made before the earliest date in the CPI data, before merging.

In [36]:
# dropping movies using conditoinal on lower range of time data in CPI dataset
df.drop(df[df['release_date'] < inflation_df['date'][0]].index.tolist(), inplace=True)
rows_dropped()

'195 row(s) just dropped.'

I want to use pd.merge_asof, but it won't merge on NaT values.<br>
I want to keep these entries, in the event that I eventually find those release dates from another source.<br>
My solution is to convert them to an unrealistic movie release date that is out of range of the CPI datset.<br>
I will convert them back to NaT after the merge.<br>
Another solution would be to extract those entries into their own DataFrame, perform the operations on the original, then merge them back.<br>
I will try this method with one of the other datasets.

In [37]:
# fill NaT values and sort by release date
df['release_date'] = df['release_date'].fillna(pd.to_datetime('1800-01-01'))
df.sort_values('release_date', inplace=True)
df.head()

,belongs_to_collection,budget,genres,id,imdb_id,release_date,revenue,runtime,title
45461,False,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",439050,tt6209470,1800-01-01,NaN,90.0,Subdue
21957,False,NaN,[],250503,tt2424418,1800-01-01,NaN,90.0,Bad Chicken
22019,False,NaN,[],173433,tt0839851,1800-01-01,NaN,90.0,Holes in My Shoes
22798,False,NaN,[],158517,tt0093383,1800-01-01,NaN,NaN,Lain ulkopuolella
24050,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",173300,tt2452236,1800-01-01,NaN,92.0,Getting Back to Abnormal

In [38]:
# merge the two datasets aligning the CPI dates to the nearest release dates going forward
df = pd.merge_asof(df, inflation_df, left_on='release_date', right_on='date')
df

,belongs_to_collection,budget,genres,id,imdb_id,release_date,revenue,runtime,title,date,cpiaucns,cpi_multiplier
0,False,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",439050,tt6209470,1800-01-01,NaN,90.0,Subdue,NaT,NaN,NaN
1,False,NaN,[],250503,tt2424418,1800-01-01,NaN,90.0,Bad Chicken,NaT,NaN,NaN
2,False,NaN,[],173433,tt0839851,1800-01-01,NaN,90.0,Holes in My Shoes,NaT,NaN,NaN
3,False,NaN,[],158517,tt0093383,1800-01-01,NaN,NaN,Lain ulkopuolella,NaT,NaN,NaN
4,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",173300,tt2452236,1800-01-01,NaN,92.0,Getting Back to Abnormal,NaT,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
45263,False,NaN,"[{'id': 18, 'name': 'Drama'}]",412059,tt5613402,2018-04-04,NaN,105.0,Mobile Homes,2018-04-01,250.546,1.030210
45264,False,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",332283,tt3906082,2018-04-25,NaN,NaN,Mary Shelley,2018-04-01,250.546,1.030210
45265,True,NaN,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",38700,tt1502397,2018-11-07,NaN,NaN,Bad Boys for Life,2018-11-01,252.038,1.024111
45266,False,12000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",299782,tt0069049,2018-12-31,NaN,NaN,The Other Side of the Wind,2018-12-01,251.233,1.027393
45267,True,NaN,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",76600,tt1630029,2020-12-16,NaN,NaN,Avatar 2,2020-03-01,258.115,1.000000

In the rows that do not have valid release date data, all the CPI values have become NaN.<br>
The rest of the CPI data looks good.

In [39]:
# convert missing release dates back to NaT and sort by release date
df['release_date'] = df['release_date'].replace(pd.to_datetime('1800-01-01'), np.nan)
df.sort_values('release_date', inplace=True)
df

,belongs_to_collection,budget,genres,id,imdb_id,release_date,revenue,runtime,title,date,cpiaucns,cpi_multiplier
87,False,NaN,[],127017,tt0003016,1913-01-01,NaN,28.0,The Inside of the White Slave Traffic,1913-01-01,9.8,26.338265
88,False,NaN,"[{'id': 28, 'name': 'Action'}, {'id': 37, 'nam...",125673,tt0003662,1913-01-01,NaN,29.0,The Battle at Elderbush Gulch,1913-01-01,9.8,26.338265
89,False,NaN,[],116857,tt0002795,1913-01-01,NaN,17.0,Death's Marathon,1913-01-01,9.8,26.338265
90,False,NaN,[],375298,tt0249011,1913-03-31,NaN,8.0,Milling the Militants,1913-03-01,9.8,26.338265
91,True,NaN,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",56508,tt0002844,1913-05-09,NaN,54.0,Fantômas: In the Shadow of the Guillotine,1913-05-01,9.7,26.609794
...,...,...,...,...,...,...,...,...,...,...,...,...
82,False,NaN,[],343227,tt1247269,NaT,NaN,98.0,El pejesapo,NaT,NaN,NaN
83,False,NaN,"[{'id': 99, 'name': 'Documentary'}]",410142,tt4150988,NaT,NaN,NaN,Lo Sound Desert,NaT,NaN,NaN
84,False,NaN,"[{'id': 99, 'name': 'Documentary'}, {'id': 12,...",164134,tt2091383,NaT,NaN,70.0,Pad Yatra: A Green Odyssey,NaT,NaN,NaN
85,False,NaN,[],38061,tt0222730,NaT,NaN,57.0,Anybody's Son Will Do,NaT,NaN,NaN
86,False,NaN,"[{'id': 18, 'name': 'Drama'}, {'id': 80, 'name...",449131,tt0321264,NaT,NaN,NaN,Aprel,NaT,NaN,NaN

The main DataFrame is back to its original form with the CPI data added.

I can get rid of the CPI values and their dates.<br>
I only need the multipliers going forward.

In [40]:
# drop CPI and CPI date data
df.drop(['date', 'cpiaucns'], axis=1, inplace=True)
df.head().transpose()

,87,88,89,90,91
belongs_to_collection,False,False,False,False,True
budget,NaN,NaN,NaN,NaN,NaN
genres,[],"[{'id': 28, 'name': 'Action'}, {'id': 37, 'nam...",[],[],"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name..."
id,127017,125673,116857,375298,56508
imdb_id,tt0003016,tt0003662,tt0002795,tt0249011,tt0002844
release_date,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-03-31 00:00:00,1913-05-09 00:00:00
revenue,NaN,NaN,NaN,NaN,NaN
runtime,28,29,17,8,54
title,The Inside of the White Slave Traffic,The Battle at Elderbush Gulch,Death's Marathon,Milling the Militants,Fantômas: In the Shadow of the Guillotine
cpi_multiplier,26.3383,26.3383,26.3383,26.3383,26.6098

From here I can take the multiplier and scale both the budget and revenue data.<br>
I will wait until I have merged this with other datasets and extracted more information from the websites, as those values may change.<br>
This is a demonstration that it can be done.

> **ID**

The id column is the TMDbID for the movie.<br>
Let's look at this one next.<br>
It has no missing values, but it is a string.

In [41]:
# make id column integer values
df['id'] = pd.to_numeric(df['id']).astype(int)
df['id'].apply(type).value_counts()

<class 'int'>    45268
Name: id, dtype: int64

In [42]:
# checking that no values are zero
df['id'].isin([0]).sum()

0

> **IMDB ID**

Now, the imdb_id has the tt prefix attached that I would like to remove, as it is not used when doing API requests with imdbpy.

In [43]:
# remove prefix
df['imdb_id'] = df['imdb_id'].str.split('tt', expand=True)[1]
df.head().transpose()

,87,88,89,90,91
belongs_to_collection,False,False,False,False,True
budget,NaN,NaN,NaN,NaN,NaN
genres,[],"[{'id': 28, 'name': 'Action'}, {'id': 37, 'nam...",[],[],"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name..."
id,127017,125673,116857,375298,56508
imdb_id,0003016,0003662,0002795,0249011,0002844
release_date,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-03-31 00:00:00,1913-05-09 00:00:00
revenue,NaN,NaN,NaN,NaN,NaN
runtime,28,29,17,8,54
title,The Inside of the White Slave Traffic,The Battle at Elderbush Gulch,Death's Marathon,Milling the Militants,Fantômas: In the Shadow of the Guillotine
cpi_multiplier,26.3383,26.3383,26.3383,26.3383,26.6098

In [44]:
# make imdb_id column integer values
df['imdb_id'] = pd.to_numeric(df['imdb_id']).astype('Int64')
df['imdb_id'].apply(type).value_counts()

<class 'int'>                            45251
<class 'pandas._libs.missing.NAType'>       17
Name: imdb_id, dtype: int64

In [45]:
# checking that no values are zero
df['imdb_id'].isin([0]).sum()

0

> **GENRES**

Let's tackle the genres colummn.<br>
I requested the movie genre id information from the TMDb website.

In [46]:
# making a list of genre id's
genres_id = [28, 12, 16, 35, 80, 99, 18, 10751, 14, 36, 27, 10402, 9648, 10749, 878, 10770, 53, 10752, 37]

In [47]:
# making a list of genre names
genres_name = ['Action', 'Adventure', 'Animation', 'Comedy', 'Crime', 'Documentary', 'Drama', 'Family', 
               'Fantasy', 'History', 'Horror', 'Music', 'Mystery', 'Romance', 'Science Fiction', 'TV Movie', 
               'Thriller', 'War', 'Western']

In [48]:
# creating a dictionary to hold the genre id information
genres = dict(zip(genres_id, genres_name))
genres

{28: 'Action',
 12: 'Adventure',
 16: 'Animation',
 35: 'Comedy',
 80: 'Crime',
 99: 'Documentary',
 18: 'Drama',
 10751: 'Family',
 14: 'Fantasy',
 36: 'History',
 27: 'Horror',
 10402: 'Music',
 9648: 'Mystery',
 10749: 'Romance',
 878: 'Science Fiction',
 10770: 'TV Movie',
 53: 'Thriller',
 10752: 'War',
 37: 'Western'}

This dictionary allows me to only retain the id part of the genres column. The names can be referenced if needed.

In [49]:
# notice this is almost a JSON-like object
df['genres'][0]

"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'name': 'Family'}]"

The string needs to have all double quotes throughout.

In [50]:
# convert single to double quotes to use JSON module
df['genres'] = df['genres'].str.replace('\'', '\"')
df['genres'][0]

'[{"id": 18, "name": "Drama"}, {"id": 10751, "name": "Family"}]'

In [51]:
# use JSON module to convert genres column of strings to Series of dicts
gen_series = df['genres'].apply(json.loads)

In [52]:
# replace the original genres column with the new one
df = df.drop('genres', axis=1).join(gen_series)
df.head().transpose()

,87,88,89,90,91
belongs_to_collection,False,False,False,False,True
budget,NaN,NaN,NaN,NaN,NaN
id,127017,125673,116857,375298,56508
imdb_id,3016,3662,2795,249011,2844
release_date,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-03-31 00:00:00,1913-05-09 00:00:00
revenue,NaN,NaN,NaN,NaN,NaN
runtime,28,29,17,8,54
title,The Inside of the White Slave Traffic,The Battle at Elderbush Gulch,Death's Marathon,Milling the Militants,Fantômas: In the Shadow of the Guillotine
cpi_multiplier,26.3383,26.3383,26.3383,26.3383,26.6098
genres,[],"[{'id': 28, 'name': 'Action'}, {'id': 37, 'nam...",[],[],"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name..."

Now, I will extract the genre id's from the values of the genre column and discard the rest of the information.

In [53]:
def get_genre_id():
    """Returns Series of genre id's grouped by movie from genres column"""
    # generate outer list
    all_vals = []
    for row in df['genres']:
        # generate inner list
        val_lst = []
        for d in row:
            # add each genre id to inner list for each movie
            val_lst.append(d.get('id'))
        # add each inner list to outer list
        all_vals.append(val_lst)
    # convert outer list to Series
    return pd.Series(all_vals)

In [54]:
# check that function works
get_genre_id()

0              []
1        [28, 37]
2              []
3              []
4        [80, 18]
           ...
45263          []
45264        [99]
45265    [99, 12]
45266          []
45267    [18, 80]
Length: 45268, dtype: object

In [55]:
# replace genre column with new sparse column
df['genres'] = get_genre_id()
df.head().transpose()

,87,88,89,90,91
belongs_to_collection,False,False,False,False,True
budget,NaN,NaN,NaN,NaN,NaN
id,127017,125673,116857,375298,56508
imdb_id,3016,3662,2795,249011,2844
release_date,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-01-01 00:00:00,1913-03-31 00:00:00,1913-05-09 00:00:00
revenue,NaN,NaN,NaN,NaN,NaN
runtime,28,29,17,8,54
title,The Inside of the White Slave Traffic,The Battle at Elderbush Gulch,Death's Marathon,Milling the Militants,Fantômas: In the Shadow of the Guillotine
cpi_multiplier,26.3383,26.3383,26.3383,26.3383,26.6098
genres,[35],"[10749, 35]",[12],[18],"[12, 18, 28, 878]"

In [56]:
# see what's left
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 45268 entries, 87 to 86
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   belongs_to_collection  45268 non-null  bool
 1   budget                 8886 non-null   float64
 2   id                     45268 non-null  int64
 3   imdb_id                45251 non-null  Int64
 4   release_date           45181 non-null  datetime64[ns]
 5   revenue                7408 non-null   float64
 6   runtime                43451 non-null  float64
 7   title                  45265 non-null  object
 8   cpi_multiplier         45181 non-null  float64
 9   genres                 45268 non-null  object
dtypes: Int64(1), bool(1), datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 4.8+ MB

> **RUNTIME**

Now, we can look at the runtime column.<br>
I don't want movies that are under 75 minutes, which is the cut off length for a feature film according to the Screen Actors Guild.

In [57]:
# remove films too short, then check
df.drop(df.loc[df['runtime'] < 70].index, inplace=True)
rows_dropped()

'3294 row(s) just dropped.'

That's a lot of entries to lose.

In [58]:
# check that it worked
df[df['runtime'] < 70]['runtime'].count()

0

> **TITLE**

The final column is the title.<br>
The data looks clean, but I'd like to know that it has only one data type.

In [59]:
# check for equality with same array after having converted its values to strings
np.array_equal(df.title, df.title.astype(str))

False

This doesn't look good. I need to find those values and inspect further.

In [60]:
# check data types in column
df['title'].apply(type).value_counts()

<class 'str'>      41971
<class 'float'>        3
Name: title, dtype: int64

In [61]:
# look at the float values
for x in df['title']:
    if isinstance(x, float):
        print(x)

nan
nan
nan

These are only the missing values. So, this column should be clean.

In [62]:
# check number of entries and columns
df.shape

(41974, 10)

Also, I'd like to make sure there are no duplicate rows.

I need to make sure that the genres column is not a list before checking for duplicate rows.

In [64]:
df = df.loc[df.astype(str).drop_duplicates().index]
rows_dropped()

'1 row(s) just dropped.'

As I will be merging all datasets by their IMBdID, I want to use that column as the DataFrame key.<br>
I will check that its values are unique.

In [65]:
# looking for duplicate values
df['imdb_id'].is_unique

False

In [66]:
# count how many duplicate values are in the column
len(list(df[df.duplicated(subset=['imdb_id'],keep=False)]['imdb_id']))

70

In [67]:
# get a count on the missing values, which are counted in the 70 above
df['imdb_id'].isnull().sum()

16

In [68]:
# look at duplicate values that are not NaN
dup_lst = list(df[df.duplicated(subset=['imdb_id'],keep=False)]['imdb_id'].dropna())
print(dup_lst)

[22537, 22537, 22879, 22879, 46468, 46468, 62229, 62229, 67306, 67306, 80000, 80000, 82992, 82992, 84387, 84387, 100361, 100361, 111613, 111613, 235679, 235679, 287635, 287635, 295682, 295682, 157472, 157472, 270288, 270288, 454792, 454792, 499537, 499537, 499456, 499456, 446676, 446676, 1180333, 1180333, 1327820, 1327820, 1701210, 1701210, 1736049, 1736049, 2018086, 2018086, 1821641, 1821641, 2121382, 2121382, 2818654, 2818654]

In [69]:
# make the id's unique
dup_lst = list(set(dup_lst))
print(dup_lst)

[80000, 499456, 295682, 46468, 454792, 22537, 100361, 287635, 62229, 235679, 157472, 84387, 2018086, 2121382, 1180333, 82992, 1821641, 1327820, 270288, 499537, 446676, 1701210, 2818654, 22879, 67306, 1736049, 111613]

In [70]:
# look at one pair
df.loc[lambda x: x['imdb_id'] == 22537, :]

,belongs_to_collection,budget,id,imdb_id,release_date,revenue,runtime,title,cpi_multiplier,genres
798,False,NaN,99080,22537,1931-06-21,NaN,70.0,The Viking,17.093709,[10749]
800,False,NaN,99080,22537,1931-06-21,NaN,70.0,The Viking,17.093709,"[28, 18]"

In [71]:
# look at another pair
df.loc[lambda x: x['imdb_id'] == 22879, :]

,belongs_to_collection,budget,id,imdb_id,release_date,revenue,runtime,title,cpi_multiplier,genres
970,False,4.0,22649,22879,1932-12-08,25.0,89.0,A Farewell to Arms,19.703435,[80]
971,False,4.0,22649,22879,1932-12-08,25.0,89.0,A Farewell to Arms,19.703435,"[35, 18, 10749]"

Now, I want to note a couple of things.<br>
First, after filtering out the the genres column, there are no duplicate IMDbID's.<br>
The genres are the values causing the trouble.<br>
I checked the samples shown above using a TMDb request.<br>
The request for the first movie has all the genres from the union of the two duplicates, plus one additional genre.<br>
The request for the second movie has two genres from the second duplicate, one from the first duplicate, and one additional genre.<br>
The accuracy of the genre data is questionable.<br>
Second, while looking at the second sample, I notice that both the revenue and budget values seem quite low.<br>
The accuracy of the budget and revenue data is questionable, as well.<br>
I suspect that once my datasets have been cleaned and wrangled, I will have to perform value validation by sampling through requests.<br>
The integrity of the data must be verified.

I would like to combine the genre values from each duplicate pair to proceed.<br>
I would like to use either groupby or pivot table to do this.<br>
I can't to that, because both groupby and pivot table will drop rows that have NaN's in any index column, even if the rows match.

In [72]:
# look at a pair that will be dropped by groupby if I try to combine all the genres into one list
df.loc[lambda x: x['imdb_id'] == 46468, :]

,belongs_to_collection,budget,id,imdb_id,release_date,revenue,runtime,title,cpi_multiplier,genres
4119,False,NaN,132641,46468,1953-04-29,NaN,89.0,Wife,9.703571,"[80, 18, 9648, 10749, 53]"
4120,False,NaN,132641,46468,1953-04-29,NaN,89.0,Wife,9.703571,[18]

I am going to end this here, because wrangling data containing null values is not a good idea.<br>
My strategy going forward will be to break off the incomplete entries to a separate file and concatenate them back if I find the missing data.<br>
After going through the same kind of problems with the CPI data, lesson learned.

Below is some code that I was using to try to fix the genre problem.<br>
Look at it if you want, but it was pretty much a waste of time.<br>
I am keeping it here for now, just in case I ever need to look back at some of the things that I tried.

In [73]:
raise SystemExit("Stop right there!")

SystemExit: Stop right there!

/home/lord_black/anaconda3/envs/movieCap1/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3339: UserWarning: To exit: use 'exit', 'quit', or Ctrl-D.
  warn("To exit: use 'exit', 'quit', or Ctrl-D.", stacklevel=1)

In [ ]:
# looking for null values
for val in dup_lst:
    print(df.loc[lambda x: x['imdb_id'] == val, :].isnull().sum())

All the null values ar either in the budget or revenue columns

In [ ]:
# this was a complete mess, did not work
# trying to convert budget and revenue to strings in order to use groupby, but I was only modifying a slice
for val in dup_lst:
    df.loc[lambda x: x['imdb_id'] == val, :]['budget'] = df.loc[lambda x: x['imdb_id'] == val, :]['budget'].astype(str)
    df.loc[lambda x: x['imdb_id'] == val, :]['revenue'] = df.loc[lambda x: x['imdb_id'] == val, :]['revenue'].astype(str)

In [ ]:
# testing converting NaN to string
df.loc[lambda x: x['imdb_id'] == 46468, :]['budget'].astype(str)

In [ ]:
# checking type
type(df.loc[lambda x: x['imdb_id'] == 46468, :].at[4119, 'budget'])

In [ ]:
# this part worked, figured out a way to get all of the genres together if there weren't any NaN's
# had to make them strings, then groupby
# convert genres to a string to aggregate using groupby
df['genres'] = df['genres'].map(lambda x: str(x).strip('[]'))
df.loc[lambda x: x['imdb_id'] == 46468, :]

In [ ]:
# make list of columns to group by
gr_columns = [x for x in df.columns if x not in ['genres']]
print(gr_columns)

In [ ]:
# verifying that I can put the NaN's back after using groupby
df.loc[lambda x: x['imdb_id'] == 46468, :]['budget'].astype(str).replace('nan', np.nan)

In [ ]:
# this worked
# testing the groupby with string data types for genres
# combine genre keys
df.loc[lambda x: x['imdb_id'] == 22879, :].groupby(gr_columns).agg(lambda x: ', '.join(x))

In [ ]:
# this did not work
# it returned an empty Series because of the NaN's
# combine genre keys
df.loc[lambda x: x['imdb_id'] == 46468, :].groupby(gr_columns).agg(lambda x: ', '.join(x))

In [ ]:
# this worked
# a different syntax using groupby
df.loc[lambda x: x['imdb_id'] == 22879, :].groupby(gr_columns).agg({'genres': ', '.join})

In [ ]:
# did not work beacuse of NaN's
# returned an empty Series with a column label
df.loc[lambda x: x['imdb_id'] == 46468, :].groupby(gr_columns).agg({'genres': ', '.join})

In [ ]:
# this works
# making sure I could put the strings back into a list once combined
df.loc[lambda x: x['imdb_id'] == 22879, :]['genres'].map(lambda x: x.split(","))

In [ ]:
# combining the genres using pivot table
# this worked, no NaN's
df.loc[lambda x: x['imdb_id'] == 22879, :].pivot_table(index=gr_columns, values=['genres'], aggfunc=lambda x: ', '.join(x))

In [ ]:
# no success with pivot table and NaN's
df.loc[lambda x: x['imdb_id'] == 46468, :].pivot_table(index=gr_columns, values=['genres'], aggfunc=lambda x: ', '.join(x))

In [ ]:
# this worked
# combined genres and put them back into a list
df.loc[lambda x: x['imdb_id'] == 22879, :].pivot_table(index=gr_columns, values=['genres'], aggfunc=lambda x: list(x))

In [ ]:
# this worked
# combined genres and put them back into a list with only unique values
df.loc[lambda x: x['imdb_id'] == 22879, :].pivot_table(index=gr_columns, values=['genres'], aggfunc=lambda x: list(set(x)))

In [ ]:
# idecies of duplicates in case needed to select
dup_ind = list(df[df.duplicated(subset=['imdb_id'],keep=False)].index)
print(dup_ind)

In [ ]:
# Things to do later...

In [ ]:
#df.columns = ['a','b','c']

In [ ]:
#df.rename(columns={'old_name': 'new_ name'})

In [ ]:
#df.set_index('column_one')

In [ ]:
#df.describe()

In [ ]:
#s.value_counts(dropna=False) | View unique values and counts

In [ ]:
#df.apply(pd.Series.value_counts)

In [ ]:
# Save files...

In [75]:
#df.to_csv('movies_metadata_cleanish.csv')

In [76]:
#inflation_df.to_csv('cpi_multiplier.csv')